#include <iostream>
#include <Windows.h>
using namespace std;

// 1. Калькулятор
int main()
{
	SetConsoleOutputCP(1251);
	cout << "Введіть перше дійсне число: \n";
	double a;
	cin >> a;
	cout << "Введіть друге ціле число: \n";
	double b;
	cin >> b;
	cout << "Оберіть дію: +, -, *, /, %. \n";
	char c;
	cin >> c;

	if (c == '+') {
		cout << a + b << "\n";
	}
	else if (c == '-') {
		cout << a - b << "\n";
	}
	else if (c == '*') {
		cout << a * b << "\n";
	}
	else if (c == '/') {
		if (b == 0) {
			cout << "На нуль ділити не можна\n";
		}
		else {
			cout << a / b << "\n";
		}
	}
	else if (c == '%') {
		if (b == 0) {
			cout << "На нуль ділити не можна\n";
		}
		else {
			cout << (int)a % (int)b << "\n";
		}
	}
	else {
		cout << "Помилка\n";
	}

}

int main() {
	SetConsoleOutputCP(1251);

	cout << "Введіть перше число: \n";
	double a;
	cin >> a;
	cout << "Введіть друге число: \n";
	double b;
	cin >> b;
	cout << "Оберіть дію: + = 1 \n, - = 2 \n, * = 3 \n, / = 4 \n, % = 5. \n";
	int choice;
	cin >> choice;

	switch(choice) {
		case 1:
			cout << a + b << "\n";
			break;
		case 2:
			cout << a - b << "\n";
			break;
		case 3:
			cout << a * b << "\n";
			break;
		case 4:
			if (b == 0) {
				cout << "На нуль ділити не можна\n";
			}
			else {
				cout << a / b << "\n";
			}
			break;
		case 5:
			if (b == 0) {
				cout << "На нуль ділити не можна\n";
			}
			else {
				cout << (int)a % (int)b << "\n";
			}
			break;
		default:
			cout << "Помилка\n";
			break;
	}
}

 // 2. Мальфар
int main() {
	srand(time(0));
	rand();

	SetConsoleOutputCP(1251);
	cout << "Мальфар вітає тебе!\n" << "Постав питання:\n";
	string question;
	cin >> question;

	int min = 0;
	int max = +20;
	int K = max - min + 1;

	int x = rand() % K + min;

	if (x == 1) {
		cout << "Лихо йде за тобою, обережно!\n";
	}
	else if (x == 2) {
		cout << "Темрява згустилася, це поганий знак.\n";
	}
	else if (x == 3) {
		cout << "Тебе чекає втрата, але не кажу яка...\n";
	}
	else if (x == 4) {
		cout << "Павутина долі сплуталась, щось піде не так.\n";
	}
	else if (x == 5) {
		cout << "Мій дар не приніс добрих звісток… будь пильним.\n";
	}
	else if (x == 6) {
		cout << "Світло веде тебе, удача на твоєму боці!\n";
	}
	else if (x == 7) {
		cout << "Доля прихильна, скоро ти отримаєш подарунок.\n";
	}
	else if (x == 8) {
		cout << "Вітер змін несе добрі вісті, скористайся шансом!\n";
	}
	else if (x == 9) {
		cout << "Серце знає відповідь – попереду радість і любов.\n";
	}
	else if (x == 10) {
		cout << "Зірки вишикувались у сприятливий знак. Дій сміливо!\n";
	}
	else if (x == 11) {
		cout << "Все залежить від твого вибору, час покаже.\n";
	}
	else if (x == 12) {
		cout << "Шлях ще не визначено, але зміни близько.\n";
	}
	else if (x == 13) {
		cout << "Як хвиля – твоя доля то піднімається, то падає.\n";
	}
	else if (x == 14) {
		cout << "Чекай. Відповідь прийде, коли буде потрібна.\n";
	}
	else if (x == 15) {
		cout << "Рівновага між вогнем і кригою – знайди свій баланс.\n";
	}
	else if (x == 16) {
		cout << "Природа знає, що тобі потрібно. Прислухайся.\n";
	}
	else if (x == 17) {
		cout << "Є дві сторони медалі. \n";
	}
	else if (x == 18) {
		cout << "Все може бути інакше, ніж здається.\n";
	}
	else if (x == 19) {
		cout << "Терпіння – ось ключ до розгадки.\n";
	}
	else if (x == 20) {
		cout << "Кожен крок змінює майбутнє, вибирай мудро.\n";
	}
	else {
		cout << "Помилка\n";
	}
}

// 3. Перший мільйон.
int main() {
	SetConsoleOutputCP(1251);
	cout << "Вітаємо вас у грі 'Перший мільйон'!\n";
	cout << "При вшдповіді на запитання відповідайте обравши один з варіантів: A, B, C, D.\n" << "Також є підказки 50/50 'F' та поміч залу 'Z'\n";
	cout << "Питання 1: Яка планета ближча до сонця?\n" << "Варіанти відповіді:\n" << "A. Марс \n" << "B. Венера. \n"
		<< "C. Земля. \n" << "D. Меркурій. \n";
	char answer;
	cin >> answer;
	int x = 0;
	int y = 0;
	char F = 1;
	char Z = 1;

	if (answer == 'F') {
		F = 0;
		cout << "Підказка 50/50: Варіанти відповіді: \n" << "A. Марс \n" << "D. Меркурій. \n";
		cin >> answer;
	}
	else if (answer == 'Z') {
		Z = 0;
		cout << "Поміч залу: 80% - D, 5% - C, 13% - B, 7% - A. \n";
		cin >> answer;
	}


	if (answer == 'D') {
		cout << "Вітаємо! Ви відповіли вірно!\n";
		x = 10000;
	}
	else {
		cout << "Ви програли. Вірна відповідь: D. Меркурій.\n";
		return 0;
	}

	cout << "Питання 2: Скільки триває один тайм у футбольному матчі? \n" << "Варіанти відповіді:\n" << "A. 30 хвилин. \n" 
		<< "B. 45 хвилин. \n"<< "C. 60 хвилин. \n" << "D. 90 хвилин. \n";
	cin >> answer;

	if (answer == 'F' && F == 1) {
		F = 0;
		cout << "Підказка 50/50: Варіанти відповіді: \n" << "B. 45 хвилин. \n" << "D. 90 хвилин. \n";
		cin >> answer;
	}
	else if (answer == 'F' && F == 0) {
		cout << "Ви вже використали підказку 50/50. Введіть відповідь: \n";
		cin >> answer;
	}

	if (answer == 'Z' && Z == 1) {
		Z = 0;
		cout << "Поміч залу: 70% - B, 0% - C, 23% - D, 7% - A. \n";
		cin >> answer;
	}
	else if (answer == 'Z' && Z == 0) {
		cout << "Ви вже використали підказку залу. Введіть відповідь: \n";
		cin >> answer;
	}

	if (answer == 'B') {
		x = 20000;
		cout << "Вітаємо! Ви відповіли вірно! Ваш виграш: " << x << "\n";
	}
	else {
		cout << "Ви програли. Вірна відповідь: B. 45 хвилин.\n";
		return 0;
	}

	cout << "Питання 3: Який хімічний елемент позначається символом 'O'? \n" << "Варіанти відповіді: \n" << "A. Кисень. \n"
		"B. Сірка. \n" << "C. Гелій. \n" << "D. Залізо. \n";
	cin >> answer;

	if (answer == 'F' && F == 1) {
		F = 0;
		cout << "Підказка 50/50: Варіанти відповіді: \n" << "A. Кисень. \n" << "B. Сірка. \n";
		cin >> answer;
	}
	else if (answer == 'F' && F == 0) {
		cout << "Ви вже використали підказку 50/50. Введіть відповідь: \n";
		cin >> answer;
	}

	if (answer == 'Z' && Z == 1) {
		Z = 0;
		cout << "Поміч залу: 73% - A, 12% - C, 10% - B, 5% - D. \n";
		cin >> answer;
	}
	else if (answer == 'Z' && Z == 0) {
		cout << "Ви вже використали підказку залу. Введіть відповідь: \n";
		cin >> answer;
	}

	if (answer == 'A') {
		x = 50000;
		cout << "Вітаємо! Ви відповіли вірно! Ваш виграш: " << x << "\n";
	}
	else {
		cout << "Ви програли. Вірна відповідь: A. Кисень.\n";
		return 0;
	}
	
	    cout << "Питання 4: Яке море не має берегів ? \n" << "Варіанти відповіді : \n" << "A.Чорне море. \n" << "B.Червоне море. \n"
		<< "C. Середземне море. \n" << "D. Саргасове море. \n";
	cin >> answer;

	if (answer == 'F' && F == 1) {
		F = 0;
		cout << "Підказка 50/50: Варіанти відповіді: \n" << "B. Червоне море. \n" << "D. Саргасове море. \n";
		cin >> answer;
	}
	else if (answer == 'F' && F == 0) {
		cout << "Ви вже використали підказку 50/50. Введіть відповідь: \n";
		cin >> answer;
	}

	if (answer == 'Z' && Z == 1) {
		Z = 0;
		cout << "Поміч залу: 20% - A, 20% - B, 30% - C, 30% - D. \n";
		cin >> answer;
	}
	else if (answer == 'Z' && Z == 0) {
		cout << "Ви вже використали підказку залу. Введіть відповідь: \n";
		cin >> answer;
	}

	if (answer == 'D') {
		x = 100000;
		cout << "Вітаємо! Ви відповіли вірно! Ваш виграш: " << x << "\n";
	}
	else {
		cout << "Ви програли. Вірна відповідь: D. Саргасове море.\n";
		return 0;
	}

	cout << "Питання 5: Скільки гравців у класичній шаховій партії? \n" << "Варіанти відповіді: \n" << "A. 3. \n" << "B. 2. \n"
		<< "C. 4. \n" << "D. 1. \n";
	cin >> answer;

	if (answer == 'F' && F == 1) {
		F = 0;
		cout << "Підказка 50/50: Варіанти відповіді: \n" << "B. 2. \n" << "C. 4. \n";
		cin >> answer;
	}
	else if (answer == 'F' && F == 0) {
		cout << "Ви вже використали підказку 50/50. Введіть відповідь: \n";
		cin >> answer;
	}

	if (answer == 'Z' && Z == 1) {
		Z = 0;
		cout << "Поміч залу: 0% - A, 100% - B, 0% - C, 0% - D. \n";
		cin >> answer;
	}
	else if (answer == 'Z' && Z == 0) {
		cout << "Ви вже використали підказку залу. Введіть відповідь: \n";
		cin >> answer;
	}

	if (answer == 'B') {
	    x = 150000;
		const int y = x;
		cout << "Вітаємо! Ви відповіли вірно! Перша на згораєма сума : " << y << "\n";
	}
	else {
		cout << "Ви програли. Вірна відповідь: B. 2. \n";
		return 0;
	}

	cout << "Питання 6: Яке місто є столицею Канади? \n" << "Варіанти відповіді: \n" << "A. Торонто. \n" << "B. Ванкувер. \n"
		<< "C. Оттава. \n" << "D. Монреаль. \n";
	cin >> answer;

	if (answer == 'F' && F == 1) {
		F = 0;
		cout << "Підказка 50/50: Варіанти відповіді: \n" << "C. Оттава. \n" << "D. Монреаль. \n";
		cin >> answer;
	}
	else if (answer == 'F' && F == 0) {
		cout << "Ви вже використали підказку 50/50. Введіть відповідь: \n";
		cin >> answer;
	}

	if (answer == 'Z' && Z == 1) {
		Z = 0;
		cout << "Поміч залу: 23% - A, 17% - B, 52% - C, 8% - D. \n";
		cin >> answer;
	}
	else if (answer == 'Z' && Z == 0) {
		cout << "Ви вже використали підказку залу. Введіть відповідь: \n";
		cin >> answer;
	}

	if (answer == 'C') {
		x = 200000;
		cout << "Вітаємо! Ви відповіли вірно! Ваш виграш: " << x << "\n";
	}
	else {
		const int y = 150000;
		cout << "Ви програли. Вірна відповідь: C. Оттава. Ваш виграш: " << y << "\n";
		return 0;
	}

	cout << "Питання 7: Яка країна подарувала США Статую Свободи? \n" << "Варіанти відповіді: \n" << "A. Франція. \n" << "B. Італія. \n"
		<< "C. Іспанія. \n" << "D. Англія. \n";
	cin >> answer;
	if (answer == 'F' && F == 1) {
		F = 0;
		cout << "Підказка 50/50: Варіанти відповіді: \n" << "A. Франція. \n" << "D. Англія. \n";
		cin >> answer;
	}
	else if (answer == 'F' && F == 0) {
		cout << "Ви вже використали підказку 50/50. Введіть відповідь: \n";
		cin >> answer;
	}

	if (answer == 'Z' && Z == 1) {
		Z = 0;
		cout << "Поміч залу: 80% - A, 5% - B, 10% - C, 5% - D. \n";
		cin >> answer;
	}
	else if (answer == 'Z' && Z == 0) {
		cout << "Ви вже використали підказку залу. Введіть відповідь: \n";
		cin >> answer;
	}

	if (answer == 'A') {
		x = 250000;
		cout << "Вітаємо! Ви відповіли вірно! Ваш виграш: " << x << "\n";

	}
	else {
		const int y = 150000;
		cout << "Ви програли. Вірна відповідь: A. Франція. Ваш виграш: " << y << "\n";
		return 0;
	}

	cout << "Питання 8: Скільки сторін має куб? \n" << "Варіанти відповіді: \n" << "A. 4. \n" << "B. 6. \n" << "C. 8. \n" << "D. 12. \n";
	cin >> answer;

	if (answer == 'F' && F == 1) {
		F = 0;
		cout << "Підказка 50/50: Варіанти відповіді: \n" << "B. 6. \n" << "C. 8. \n";
		cin >> answer;
	}
	else if (answer == 'F' && F == 0) {
		cout << "Ви вже використали підказку 50/50. Введіть відповідь: \n";
		cin >> answer;
	}

	if (answer == 'Z' && Z == 1) {
		Z = 0;
		cout << "Поміч залу: 14% - A, 56% - B, 12% - C, 18% - D. \n";
		cin >> answer;
	}
	else if (answer == 'Z' && Z == 0) {
		cout << "Ви вже використали підказку залу. Введіть відповідь: \n";
		cin >> answer;
	}

	if (answer == 'B') {
		x = 500000;
		cout << "Вітаємо! Ви відповіли вірно! Ваш виграш: " << x << "\n";
	}
	else {
		const int y = 150000;
		cout << "Ви програли. Вірна відповідь: B. 6. Ваш виграш: " << y << "\n";
		return 0;
	}

	cout << "Питання 9: Як звали першого президента України? \n" << "Варіанти відповіді: \n" << "A. Леонід Кучма. \n" << "B. Віктор Янукович. \n"
		<< "C. Петро Порошенко. \n" << "D. Леонід Кравчук. \n";
	cin >> answer;

	if (answer == 'F' && F == 1) {
		F = 0;
		cout << "Підказка 50/50: Варіанти відповіді: \n" << "C. Петро Порошенко. \n" << "D. Леонід Кравчук. \n";
		cin >> answer;
	}
	else if (answer == 'F' && F == 0) {
		cout << "Ви вже використали підказку 50/50. Введіть відповідь: \n";
		cin >> answer;
	}

	if (answer == 'Z' && Z == 1) {
		Z = 0;
		cout << "Поміч залу: 30% - A, 20% - B, 20% - C, 30% - D. \n";
		cin >> answer;
	}
	else if (answer == 'Z' && Z == 0) {
		cout << "Ви вже використали підказку залу. Введіть відповідь: \n";
		cin >> answer;
	}

	if (answer == 'D') {
		x = 750000;
		cout << "Вітаємо! Ви відповіли вірно! Ваш виграш: " << x << "\n";
	}
	else {
		const int y = 150000;
		cout << "Ви програли. Вірна відповідь: D. Леонід Кравчук. Ваш виграш: " << y << "\n";
		return 0;
	}

	cout << "Питання 10: Хто написав 'Кобзар' ? \n" << "Варіанти відповіді: \n" << "A. Іван Франко. \n" << "B. Леся Українка. \n"
		<< "C. Тарас Шевченко. \n" << "D. Іван Котляревський. \n";
	cin >> answer;

	if (answer == 'F' && F == 1) {
		F = 0;
		cout << "Підказка 50/50: Варіанти відповіді: \n" << "C. Тарас Шевченко. \n" << "D. Іван Котляревський. \n";
		cin >> answer;
	}
	else if (answer == 'F' && F == 0) {
		cout << "Ви вже використали підказку 50/50. Введіть відповідь: \n";
		cin >> answer;
	}

	if (answer == 'Z' && Z == 1) {
		Z = 0;
		cout << "Поміч залу: 20% - A, 10% - B, 50% - C, 20% - D. \n";
		cin >> answer;
	}
	else if (answer == 'Z' && Z == 0) {
		cout << "Ви вже використали підказку залу. Введіть відповідь: \n";
		cin >> answer;
	}

	if (answer == 'C') {
		x = 1000000;
		cout << "Вітаємо! Ви відповіли вірно на всі питіння та стали перможцем нашої гри! Ваш виграш: " << x << "\n";
	}
	else {
		const int y = 150000;
		cout << "Ви програли. Вірна відповідь: C. Тарас Шевченко. Ваш виграш: " << y << "\n";
		return 0;
	}
}