#include <iostream>
#include <windows.h>
using namespace std;

int main()
{
	SetConsoleOutputCP(1251);
	system("color 9E");
	cout << "\n\t\t\t\t\t\t Резюме\n\n";
	cout << "\tПро себе:\n";
	cout << " Name - Максим\n" << " Surname - Сергійович\n" << " Age - 43\n" << " Сountry - Україна\n" << " City - Харків\n\n";
	cout << "\tЯ – професійний будівельник із понад 20 роками досвіду, що охоплює різні етапи зведення житлових,\n" <<
		" комерційних і промислових об’єктів. Спеціалізуюся на будівельних роботах \"під ключ\"– від фундаменту до\n" <<         
		" оздоблення.Відмінно володію техніками кладки, бетонування, монтажу конструкцій та внутрішнього оздоблення.\n" <<
		" Маю досвід роботи як у великих будівельних компаніях, так і на приватних проектах, що дозволило розвинути \n" <<
		" гнучкість, відповідальність і навички комунікації з клієнтами. Високо ціную якість у роботі та завжди прагну \n" <<
		" до дотримання термінів. Вірю, що кожна споруда – це відображення професіоналізму команди, і пишаюся, коли\n" <<
		" результати моєї роботи відповідають найвищим стандартам.Моє прагнення до постійного вдосконалення змушує\n" <<
		" мене слідкувати за новітніми технологіями, матеріалами та трендами в будівництві. Моє гасло : \n" <<
		" \t\t\"Будувати не просто споруди, а комфорт і затишок для людей!\"\n\n";
	cout << "\t\t\t\t\t\tОсвіта\n\n" <<
		" 1.Київський національний університет будівництва та архітектури (КНУБА)\n" <<
		" 2.Професійний ліцей №14, м. Харків - Спеціальність: Маляр-штукатур.\n" <<
		" 3.Курси з енергоефективного будівництва\n\n";
	cout << "\t\t\t\t\t\tДосвід роботи\n\n" <<
		" 1.Приватні проекти - Позиція: Універсальний будівельник (2002 – 2014)\n" <<
		" 2.Будівельна компанія \"Будівельник\" - Позиція: Бригадир (2014 – 2018)\n" <<
		" 3.Будівельна компанія \"БудМайстер\" - Позиція: Будівельник (2020 – 2023)\n\n";
	cout << "\t\t\t\t\t\tНавички\n\n" << " 1.Володію техніками кладки, бетонування, монтажу конструкцій та внутрішнього оздоблення.\n" <<
		" 2.Вмію працювати з будь-якими будівельними матеріалами.\n" <<
		" 3.Вмію читати та розуміти будівельні креслення.\n" <<
		" 4.Вмію працювати з будь-якими будівельними інструментами.\n" <<
		" 5.Вмію працювати з будь-якими будівельними машинами.\n" <<
		" 6.Вмію працювати з будь-якими будівельними технологіями.\n" <<
		" 7.Вмію працювати з будь-якими будівельними програмами.\n\n";
	cout << "\tКонтакти:\n" << " Телефон - +380 50 123 45 67\n" << " E-mail - sawivanko@gmail.com\n";
}